## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (config refers to values not yet known)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = (known after apply)
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/fbcf610c234521d0060bff6e3e5db47aa3a97cc5" -> (known after apply)
!       name               = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/fbcf610c234521d0060bff6e3e5db47aa3a97cc5" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJWCtkOG5OK0pNUDB3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQXpPVFF5TnpjM01qYzVOREUwTkRRek9EVTFNQ0FYRFRJeU1Ea3hOekUyTWpRME5sb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1ETTVOREkzTnpjeU56azBNVFEwTkRNNE5UVXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRQ0gwZFYyZytRRllQVzhFbVBuWUl3Q2hpK3MKQjVyMkZ6MmQ0a0FxbkJwT3ppbTRIeEJQVlRzdGthV254eU9LWWZSdFp1ZGtDUkh3YStPakM0aTZSSHV0RkIweAp0YnRTVVdzeGpXZGJOenJCbHlRSGorM3pwODdJSlZucklTSlMwbXVwV0h2OEVFVGhKbUtTaERlVEhLS1BkNEZHCkdiWlhqZXBOWlRvL3piZmszYnQ2aXJGZ0VUVEd4TDY2c1lLQ2J0MVhkczJQL0N0MW9PTjBBQVBYMFJ4MlFwUTMKcHhQZEUxZFBoRkN2VXBuSFJNMks1MVo1MFR6a29HU0dlRHpCeklneW8yMjROUVVhRXpxUHJ1R285MWtVNnIwRQpBTmVVVEJYWHdDcXFKd3lrVXBmNzErQnNuVzVjcS9aNEJOVW1iV2IvNy80UElkdDd1aWIveThreCtzVDdBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQUh1STFGek1EdW5Jdk05cHBpYXBkYwpwY2FzcytxWlZ3dThmK00rblBvRzZ3NFd1akFvZU9QZDV5TG1UK2htRWVpZU9ReDcwYkNxd0pIeWJkQm0rQURXCjRSb0liL2hpVFd4SWhwQmxNTE50WmRhdy9RQWhraC94Vnc5TVJWbVFnSnRiaEo2MFBPOFcrcWRhdkRMbnZQNHoKdzF0VlEySUlnclJnOHpFVlVVQzJXMmdvMlVZczVDQlJZY1BqZFZ6clczbVhXd1lrZGpnbmhSTWxBMlhncUc3YQpwS1ZZRkVrMFREdjU2NlV2UldBM25WQWFRbXpaWG9qY1ViN214VWVIS0VscWlLcUFYcjlpL1JraWVGalZFRnZwCmRjVm05L1FXTXA1YlRJTVdoZXgwU3NGN2JVWHN0ZWJZNk54a1A5cmlobnFuVkNTcTBIeUJ3OWxMeFIrRk44UFMKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-09-17T16:24:46Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_secret.external-dns-credentials will be created
+   resource "kubernetes_secret" "external-dns-credentials" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "external-dns"
+           namespace        = "dns"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.external-dns.module.iam.google_service_account_iam_binding.service_account_iam_authoritative["default--roles/iam.workloadIdentityUser"] will be created
+   resource "google_service_account_iam_binding" "service_account_iam_authoritative" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       members            = (known after apply)
+       role               = (known after apply)
+       service_account_id = (known after apply)

+       condition {
+           description = (known after apply)
+           expression  = (known after apply)
+           title       = (known after apply)
        }
    }

  # module.external-dns.module.service_account.google_project_iam_member.project-roles["external-dns-terrateam-362405=>roles/dns.admin"] will be created
+   resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "terrateam-362405"
+       role    = "roles/dns.admin"
    }

  # module.external-dns.module.service_account.google_service_account.service_accounts["external-dns"] will be created
+   resource "google_service_account" "service_accounts" {
+       account_id   = "external-dns"
+       disabled     = false
+       display_name = "Terraform-managed service account"
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       project      = "terrateam-362405"
+       unique_id    = (known after apply)
    }

  # module.external_dns.module.iam.google_service_account_iam_binding.service_account_iam_authoritative["default--roles/iam.workloadIdentityUser"] will be destroyed
  # (because google_service_account_iam_binding.service_account_iam_authoritative is not in configuration)
-   resource "google_service_account_iam_binding" "service_account_iam_authoritative" {
-       etag               = "BwXo4WO21aA=" -> null
-       id                 = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> null
-       members            = [
-           "serviceAccount:terrateam-362405.svc.id.goog[dns/gke-external-dns]",
        ] -> null
-       role               = "roles/iam.workloadIdentityUser" -> null
-       service_account_id = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com" -> null
    }

  # module.external_dns.module.service_account.google_project_iam_member.project-roles["external-dns-terrateam-362405=>roles/dns.admin"] will be destroyed
  # (because google_project_iam_member.project-roles is not in configuration)
-   resource "google_project_iam_member" "project-roles" {
-       etag    = "BwXo4ep7a0Y=" -> null
-       id      = "terrateam-362405/roles/dns.admin/serviceAccount:external-dns@terrateam-362405.iam.gserviceaccount.com" -> null
-       member  = "serviceAccount:external-dns@terrateam-362405.iam.gserviceaccount.com" -> null
-       project = "terrateam-362405" -> null
-       role    = "roles/dns.admin" -> null
    }

  # module.external_dns.module.service_account.google_service_account.service_accounts["external-dns"] will be destroyed
  # (because google_service_account.service_accounts is not in configuration)
-   resource "google_service_account" "service_accounts" {
-       account_id   = "external-dns" -> null
-       disabled     = false -> null
-       display_name = "Terraform-managed service account" -> null
-       email        = "external-dns@terrateam-362405.iam.gserviceaccount.com" -> null
-       id           = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com" -> null
-       name         = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com" -> null
-       project      = "terrateam-362405" -> null
-       unique_id    = "103942777279414443855" -> null
    }

Plan: 5 to add, 0 to change, 4 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
